head	1.6;
access;
symbols
	OPENBSD_6_2_BASE:1.6
	OPENBSD_6_1:1.6.0.40
	OPENBSD_6_1_BASE:1.6
	OPENBSD_6_0:1.6.0.36
	OPENBSD_6_0_BASE:1.6
	OPENBSD_5_9:1.6.0.32
	OPENBSD_5_9_BASE:1.6
	OPENBSD_5_8:1.6.0.34
	OPENBSD_5_8_BASE:1.6
	OPENBSD_5_7:1.6.0.26
	OPENBSD_5_7_BASE:1.6
	OPENBSD_5_6:1.6.0.30
	OPENBSD_5_6_BASE:1.6
	OPENBSD_5_5:1.6.0.28
	OPENBSD_5_5_BASE:1.6
	OPENBSD_5_4:1.6.0.24
	OPENBSD_5_4_BASE:1.6
	OPENBSD_5_3:1.6.0.22
	OPENBSD_5_3_BASE:1.6
	OPENBSD_5_2:1.6.0.20
	OPENBSD_5_2_BASE:1.6
	OPENBSD_5_1_BASE:1.6
	OPENBSD_5_1:1.6.0.18
	OPENBSD_5_0:1.6.0.16
	OPENBSD_5_0_BASE:1.6
	OPENBSD_4_9:1.6.0.14
	OPENBSD_4_9_BASE:1.6
	OPENBSD_4_8:1.6.0.12
	OPENBSD_4_8_BASE:1.6
	OPENBSD_4_7:1.6.0.8
	OPENBSD_4_7_BASE:1.6
	OPENBSD_4_6:1.6.0.10
	OPENBSD_4_6_BASE:1.6
	OPENBSD_4_5:1.6.0.6
	OPENBSD_4_5_BASE:1.6
	OPENBSD_4_4:1.6.0.4
	OPENBSD_4_4_BASE:1.6
	BIND_9_4_2_P1:1.1.1.5
	OPENBSD_4_3:1.6.0.2
	OPENBSD_4_3_BASE:1.6
	BIND_9_4_2:1.1.1.5
	OPENBSD_4_2:1.5.0.4
	OPENBSD_4_2_BASE:1.5
	OPENBSD_4_1:1.5.0.2
	OPENBSD_4_1_BASE:1.5
	BIND_9_3_4:1.1.1.4
	BIND_9_3_3:1.1.1.4
	OPENBSD_4_0:1.4.0.2
	OPENBSD_4_0_BASE:1.4
	BIND_9_3_2:1.1.1.3
	OPENBSD_3_9:1.3.0.6
	OPENBSD_3_9_BASE:1.3
	OPENBSD_3_8:1.3.0.4
	OPENBSD_3_8_BASE:1.3
	BIND_9_3_1:1.1.1.2
	OPENBSD_3_7:1.3.0.2
	OPENBSD_3_7_BASE:1.3
	BIND_9_3_0:1.1.1.2
	OPENBSD_3_6:1.2.0.8
	OPENBSD_3_6_BASE:1.2
	OPENBSD_3_5:1.2.0.6
	OPENBSD_3_5_BASE:1.2
	OPENBSD_3_4:1.2.0.4
	OPENBSD_3_4_BASE:1.2
	OPENBSD_3_3:1.2.0.2
	OPENBSD_3_3_BASE:1.2
	BIND_9_2_2_RC1:1.1.1.1
	ISC:1.1.1;
locks; strict;
comment	@# @;


1.6
date	2007.12.09.13.39.42;	author jakob;	state Exp;
branches;
next	1.5;

1.5
date	2007.01.10.19.07.58;	author jakob;	state Exp;
branches;
next	1.4;

1.4
date	2006.04.05.17.36.32;	author jakob;	state Exp;
branches;
next	1.3;

1.3
date	2004.09.28.17.14.03;	author jakob;	state Exp;
branches;
next	1.2;

1.2
date	2003.03.05.09.18.31;	author jakob;	state Exp;
branches;
next	1.1;

1.1
date	2003.01.20.21.06.04;	author jakob;	state Exp;
branches
	1.1.1.1;
next	;

1.1.1.1
date	2003.01.20.21.06.04;	author jakob;	state Exp;
branches;
next	1.1.1.2;

1.1.1.2
date	2004.09.28.16.32.49;	author jakob;	state Exp;
branches;
next	1.1.1.3;

1.1.1.3
date	2006.04.05.16.42.03;	author jakob;	state Exp;
branches;
next	1.1.1.4;

1.1.1.4
date	2007.01.10.18.18.19;	author jakob;	state Exp;
branches;
next	1.1.1.5;

1.1.1.5
date	2007.12.09.12.33.18;	author jakob;	state Exp;
branches;
next	;


desc
@@


1.6
log
@resolve conflicts
@
text
@<!--
 - Copyright (C) 2004, 2005, 2007 Internet Systems Consortium, Inc. ("ISC")
 - Copyright (C) 2000-2002 Internet Software Consortium.
 - 
 - Permission to use, copy, modify, and distribute this software for any
 - purpose with or without fee is hereby granted, provided that the above
 - copyright notice and this permission notice appear in all copies.
 - 
 - THE SOFTWARE IS PROVIDED "AS IS" AND ISC DISCLAIMS ALL WARRANTIES WITH
 - REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY
 - AND FITNESS. IN NO EVENT SHALL ISC BE LIABLE FOR ANY SPECIAL, DIRECT,
 - INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM
 - LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE
 - OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR
 - PERFORMANCE OF THIS SOFTWARE.
-->
<!-- $ISC: host.html,v 1.7.18.20 2007/05/09 03:33:12 marka Exp $ -->
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<title>host</title>
<meta name="generator" content="DocBook XSL Stylesheets V1.71.1">
</head>
<body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="refentry" lang="en">
<a name="man.host"></a><div class="titlepage"></div>
<div class="refnamediv">
<h2>Name</h2>
<p>host &#8212; DNS lookup utility</p>
</div>
<div class="refsynopsisdiv">
<h2>Synopsis</h2>
<div class="cmdsynopsis"><p><code class="command">host</code>  [<code class="option">-aCdlnrsTwv</code>] [<code class="option">-c <em class="replaceable"><code>class</code></em></code>] [<code class="option">-N <em class="replaceable"><code>ndots</code></em></code>] [<code class="option">-R <em class="replaceable"><code>number</code></em></code>] [<code class="option">-t <em class="replaceable"><code>type</code></em></code>] [<code class="option">-W <em class="replaceable"><code>wait</code></em></code>] [<code class="option">-m <em class="replaceable"><code>flag</code></em></code>] [<code class="option">-4</code>] [<code class="option">-6</code>] {name} [server]</p></div>
</div>
<div class="refsect1" lang="en">
<a name="id2543428"></a><h2>DESCRIPTION</h2>
<p><span><strong class="command">host</strong></span>
      is a simple utility for performing DNS lookups.
      It is normally used to convert names to IP addresses and vice versa.
      When no arguments or options are given,
      <span><strong class="command">host</strong></span>
      prints a short summary of its command line arguments and options.
    </p>
<p><em class="parameter"><code>name</code></em> is the domain name that is to be
      looked
      up.  It can also be a dotted-decimal IPv4 address or a colon-delimited
      IPv6 address, in which case <span><strong class="command">host</strong></span> will by
      default
      perform a reverse lookup for that address.
      <em class="parameter"><code>server</code></em> is an optional argument which
      is either
      the name or IP address of the name server that <span><strong class="command">host</strong></span>
      should query instead of the server or servers listed in
      <code class="filename">/etc/resolv.conf</code>.
    </p>
<p>
      The <code class="option">-a</code> (all) option is equivalent to setting the
      <code class="option">-v</code> option and asking <span><strong class="command">host</strong></span> to make
      a query of type ANY.
    </p>
<p>
      When the <code class="option">-C</code> option is used, <span><strong class="command">host</strong></span>
      will attempt to display the SOA records for zone
      <em class="parameter"><code>name</code></em> from all the listed
      authoritative name
      servers for that zone.  The list of name servers is defined by the NS
      records that are found for the zone.
    </p>
<p>
      The <code class="option">-c</code> option instructs to make a DNS query of class
      <em class="parameter"><code>class</code></em>.  This can be used to lookup
      Hesiod or
      Chaosnet class resource records.  The default class is IN (Internet).
    </p>
<p>
      Verbose output is generated by <span><strong class="command">host</strong></span> when
      the
      <code class="option">-d</code> or <code class="option">-v</code> option is used.  The two
      options are equivalent.  They have been provided for backwards
      compatibility.  In previous versions, the <code class="option">-d</code> option
      switched on debugging traces and <code class="option">-v</code> enabled verbose
      output.
    </p>
<p>
      List mode is selected by the <code class="option">-l</code> option.  This makes
      <span><strong class="command">host</strong></span> perform a zone transfer for zone
      <em class="parameter"><code>name</code></em>.  Transfer the zone printing out
      the NS, PTR
      and address records (A/AAAA).  If combined with <code class="option">-a</code>
      all records will be printed.
    </p>
<p>
      The <code class="option">-i</code>
      option specifies that reverse lookups of IPv6 addresses should
      use the IP6.INT domain as defined in RFC1886.
      The default is to use IP6.ARPA.
    </p>
<p>
      The <code class="option">-N</code> option sets the number of dots that have to be
      in <em class="parameter"><code>name</code></em> for it to be considered
      absolute.  The
      default value is that defined using the ndots statement in
      <code class="filename">/etc/resolv.conf</code>, or 1 if no ndots
      statement is
      present.  Names with fewer dots are interpreted as relative names and
      will be searched for in the domains listed in the <span class="type">search</span>
      or <span class="type">domain</span> directive in
      <code class="filename">/etc/resolv.conf</code>.
    </p>
<p>
      The number of UDP retries for a lookup can be changed with the
      <code class="option">-R</code> option.  <em class="parameter"><code>number</code></em>
      indicates
      how many times <span><strong class="command">host</strong></span> will repeat a query
      that does
      not get answered.  The default number of retries is 1.  If
      <em class="parameter"><code>number</code></em> is negative or zero, the
      number of
      retries will default to 1.
    </p>
<p>
      Non-recursive queries can be made via the <code class="option">-r</code> option.
      Setting this option clears the <span class="type">RD</span> &#8212; recursion
      desired &#8212; bit in the query which <span><strong class="command">host</strong></span> makes.
      This should mean that the name server receiving the query will not
      attempt to resolve <em class="parameter"><code>name</code></em>.  The
      <code class="option">-r</code> option enables <span><strong class="command">host</strong></span>
      to mimic
      the behavior of a name server by making non-recursive queries and
      expecting to receive answers to those queries that are usually
      referrals to other name servers.
    </p>
<p>
      By default <span><strong class="command">host</strong></span> uses UDP when making
      queries.  The
      <code class="option">-T</code> option makes it use a TCP connection when querying
      the name server.  TCP will be automatically selected for queries that
      require it, such as zone transfer (AXFR) requests.
    </p>
<p>
      The <code class="option">-4</code> option forces <span><strong class="command">host</strong></span> to only
      use IPv4 query transport.  The <code class="option">-6</code> option forces
      <span><strong class="command">host</strong></span> to only use IPv6 query transport.
    </p>
<p>
      The <code class="option">-t</code> option is used to select the query type.
      <em class="parameter"><code>type</code></em> can be any recognized query
      type: CNAME,
      NS, SOA, SIG, KEY, AXFR, etc.  When no query type is specified,
      <span><strong class="command">host</strong></span> automatically selects an appropriate
      query
      type.  By default it looks for A records, but if the
      <code class="option">-C</code> option was given, queries will be made for SOA
      records, and if <em class="parameter"><code>name</code></em> is a
      dotted-decimal IPv4
      address or colon-delimited IPv6 address, <span><strong class="command">host</strong></span> will
      query for PTR records.  If a query type of IXFR is chosen the starting
      serial number can be specified by appending an equal followed by the
      starting serial number (e.g. -t IXFR=12345678).
    </p>
<p>
      The time to wait for a reply can be controlled through the
      <code class="option">-W</code> and <code class="option">-w</code> options.  The
      <code class="option">-W</code> option makes <span><strong class="command">host</strong></span>
      wait for
      <em class="parameter"><code>wait</code></em> seconds.  If <em class="parameter"><code>wait</code></em>
      is less than one, the wait interval is set to one second.  When the
      <code class="option">-w</code> option is used, <span><strong class="command">host</strong></span>
      will
      effectively wait forever for a reply.  The time to wait for a response
      will be set to the number of seconds given by the hardware's maximum
      value for an integer quantity.
    </p>
<p>
      The <code class="option">-s</code> option tells <span><strong class="command">host</strong></span> 
      <span class="emphasis"><em>not</em></span> to send the query to the next nameserver
      if any server responds with a SERVFAIL response, which is the
      reverse of normal stub resolver behavior.
    </p>
<p>
      The <code class="option">-m</code> can be used to set the memory usage debugging
      flags
      <em class="parameter"><code>record</code></em>, <em class="parameter"><code>usage</code></em> and
      <em class="parameter"><code>trace</code></em>.
    </p>
</div>
<div class="refsect1" lang="en">
<a name="id2543725"></a><h2>IDN SUPPORT</h2>
<p>
      If <span><strong class="command">host</strong></span> has been built with IDN (internationalized
      domain name) support, it can accept and display non-ASCII domain names. 
      <span><strong class="command">host</strong></span> appropriately converts character encoding of
      domain name before sending a request to DNS server or displaying a
      reply from the server.
      If you'd like to turn off the IDN support for some reason, defines
      the <code class="envar">IDN_DISABLE</code> environment variable.
      The IDN support is disabled if the variable is set when
      <span><strong class="command">host</strong></span> runs.
    </p>
</div>
<div class="refsect1" lang="en">
<a name="id2543748"></a><h2>FILES</h2>
<p><code class="filename">/etc/resolv.conf</code>
    </p>
</div>
<div class="refsect1" lang="en">
<a name="id2543828"></a><h2>SEE ALSO</h2>
<p><span class="citerefentry"><span class="refentrytitle">dig</span>(1)</span>,
      <span class="citerefentry"><span class="refentrytitle">named</span>(8)</span>.
    </p>
</div>
</div></body>
</html>
@


1.5
log
@resolve conflicts and regen configure script
@
text
@d2 1
a2 1
 - Copyright (C) 2004, 2005 Internet Systems Consortium, Inc. ("ISC")
d17 1
a17 1
<!-- $ISC: host.html,v 1.4.2.1.4.14 2006/06/29 13:02:30 marka Exp $ -->
d22 1
a22 1
<meta name="generator" content="DocBook XSL Stylesheets V1.70.1">
d25 1
a25 1
<a name="id2482688"></a><div class="titlepage"></div>
d32 1
a32 1
<div class="cmdsynopsis"><p><code class="command">host</code>  [<code class="option">-aCdlnrTwv</code>] [<code class="option">-c <em class="replaceable"><code>class</code></em></code>] [<code class="option">-N <em class="replaceable"><code>ndots</code></em></code>] [<code class="option">-R <em class="replaceable"><code>number</code></em></code>] [<code class="option">-t <em class="replaceable"><code>type</code></em></code>] [<code class="option">-W <em class="replaceable"><code>wait</code></em></code>] [<code class="option">-4</code>] [<code class="option">-6</code>] {name} [server]</p></div>
d35 153
a187 1
<a name="id2549466"></a><h2>DESCRIPTION</h2>
d189 10
a198 119
<span><strong class="command">host</strong></span>
is a simple utility for performing DNS lookups.
It is normally used to convert names to IP addresses and vice versa.
When no arguments or options are given,
<span><strong class="command">host</strong></span>
prints a short summary of its command line arguments and options.
</p>
<p>
<em class="parameter"><code>name</code></em> is the domain name that is to be looked
up.  It can also be a dotted-decimal IPv4 address or a colon-delimited
IPv6 address, in which case <span><strong class="command">host</strong></span> will by default
perform a reverse lookup for that address.
<em class="parameter"><code>server</code></em> is an optional argument which is either
the name or IP address of the name server that <span><strong class="command">host</strong></span>
should query instead of the server or servers listed in
<code class="filename">/etc/resolv.conf</code>.
</p>
<p>
The <code class="option">-a</code> (all) option is equivalent to setting the
<code class="option">-v</code> option and asking <span><strong class="command">host</strong></span> to make
a query of type ANY.
</p>
<p>
When the <code class="option">-C</code> option is used, <span><strong class="command">host</strong></span>
will attempt to display the SOA records for zone
<em class="parameter"><code>name</code></em> from all the listed authoritative name
servers for that zone.  The list of name servers is defined by the NS
records that are found for the zone.
</p>
<p>
The <code class="option">-c</code> option instructs to make a DNS query of class
<em class="parameter"><code>class</code></em>.  This can be used to lookup Hesiod or
Chaosnet class resource records.  The default class is IN (Internet).
</p>
<p>
Verbose output is generated by <span><strong class="command">host</strong></span> when the
<code class="option">-d</code> or <code class="option">-v</code> option is used.  The two
options are equivalent.  They have been provided for backwards
compatibility.  In previous versions, the <code class="option">-d</code> option
switched on debugging traces and <code class="option">-v</code> enabled verbose
output.
</p>
<p>
List mode is selected by the <code class="option">-l</code> option.  This makes
<span><strong class="command">host</strong></span> perform a zone transfer for zone
<em class="parameter"><code>name</code></em>.  Transfer the zone printing out the NS, PTR
and address records (A/AAAA).  If combined with <code class="option">-a</code>
all records will be printed.  
</p>
<p>
The <code class="option">-i</code>
option specifies that reverse lookups of IPv6 addresses should
use the IP6.INT domain as defined in RFC1886.
The default is to use IP6.ARPA.
</p>
<p>
The <code class="option">-N</code> option sets the number of dots that have to be
in <em class="parameter"><code>name</code></em> for it to be considered absolute.  The
default value is that defined using the ndots statement in
<code class="filename">/etc/resolv.conf</code>, or 1 if no ndots statement is
present.  Names with fewer dots are interpreted as relative names and
will be searched for in the domains listed in the <span class="type">search</span>
or <span class="type">domain</span> directive in
<code class="filename">/etc/resolv.conf</code>.
</p>
<p>
The number of UDP retries for a lookup can be changed with the
<code class="option">-R</code> option.  <em class="parameter"><code>number</code></em> indicates
how many times <span><strong class="command">host</strong></span> will repeat a query that does
not get answered.  The default number of retries is 1.  If
<em class="parameter"><code>number</code></em> is negative or zero, the number of
retries will default to 1.
</p>
<p>
Non-recursive queries can be made via the <code class="option">-r</code> option.
Setting this option clears the <span class="type">RD</span> &#8212; recursion
desired &#8212; bit in the query which <span><strong class="command">host</strong></span> makes.
This should mean that the name server receiving the query will not
attempt to resolve <em class="parameter"><code>name</code></em>.  The
<code class="option">-r</code> option enables <span><strong class="command">host</strong></span> to mimic
the behaviour of a name server by making non-recursive queries and
expecting to receive answers to those queries that are usually
referrals to other name servers.
</p>
<p>
By default <span><strong class="command">host</strong></span> uses UDP when making queries.  The
<code class="option">-T</code> option makes it use a TCP connection when querying
the name server.  TCP will be automatically selected for queries that
require it, such as zone transfer (AXFR) requests.
</p>
<p>
The <code class="option">-4</code> option forces <span><strong class="command">host</strong></span> to only
use IPv4 query transport.  The <code class="option">-6</code> option forces
<span><strong class="command">host</strong></span> to only use IPv6 query transport.
</p>
<p>
The <code class="option">-t</code> option is used to select the query type.
<em class="parameter"><code>type</code></em> can be any recognised query type: CNAME,
NS, SOA, SIG, KEY, AXFR, etc.  When no query type is specified,
<span><strong class="command">host</strong></span> automatically selects an appropriate query
type.  By default it looks for A records, but if the
<code class="option">-C</code> option was given, queries will be made for SOA
records, and if <em class="parameter"><code>name</code></em> is a dotted-decimal IPv4
address or colon-delimited IPv6 address, <span><strong class="command">host</strong></span> will
query for PTR records.  If a query type of IXFR is chosen the starting
serial number can be specified by appending an equal followed by the
starting serial number (e.g. -t IXFR=12345678).
</p>
<p>
The time to wait for a reply can be controlled through the
<code class="option">-W</code> and <code class="option">-w</code> options.  The
<code class="option">-W</code> option makes <span><strong class="command">host</strong></span> wait for
<em class="parameter"><code>wait</code></em> seconds.  If <em class="parameter"><code>wait</code></em>
is less than one, the wait interval is set to one second.  When the
<code class="option">-w</code> option is used, <span><strong class="command">host</strong></span> will
effectively wait forever for a reply.  The time to wait for a response
will be set to the number of seconds given by the hardware's maximum
value for an integer quantity.
</p>
d201 3
a203 4
<a name="id2549874"></a><h2>FILES</h2>
<p>
<code class="filename">/etc/resolv.conf</code>
</p>
d206 4
a209 5
<a name="id2549886"></a><h2>SEE ALSO</h2>
<p>
<span class="citerefentry"><span class="refentrytitle">dig</span>(1)</span>,
<span class="citerefentry"><span class="refentrytitle">named</span>(8)</span>.
</p>
@


1.4
log
@resolve conflicts
@
text
@d17 1
a17 1
<!-- $ISC: host.html,v 1.4.2.1.4.12 2005/10/13 02:33:44 marka Exp $ -->
d22 1
a22 1
<meta name="generator" content="DocBook XSL Stylesheets V1.69.1">
d25 1
a25 1
<a name="id2463721"></a><div class="titlepage"></div>
d35 1
a35 1
<a name="id2525901"></a><h2>DESCRIPTION</h2>
d158 1
a158 1
<a name="id2526241"></a><h2>FILES</h2>
d164 1
a164 1
<a name="id2526253"></a><h2>SEE ALSO</h2>
@


1.3
log
@resolve conflicts
@
text
@d2 3
a4 3
 - Copyright (C) 2004  Internet Systems Consortium, Inc. ("ISC")
 - Copyright (C) 2000-2002  Internet Software Consortium.
 -
d8 1
a8 1
 -
d11 1
a11 1
 - AND FITNESS.  IN NO EVENT SHALL ISC BE LIABLE FOR ANY SPECIAL, DIRECT,
d17 21
a37 95

<!-- $ISC: host.html,v 1.4.2.1.4.6 2004/08/22 23:38:58 marka Exp $ -->

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML
><HEAD
><TITLE
>host</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.7"></HEAD
><BODY
CLASS="REFENTRY"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><H1
><A
NAME="AEN1"
></A
>host</H1
><DIV
CLASS="REFNAMEDIV"
><A
NAME="AEN8"
></A
><H2
>Name</H2
>host&nbsp;--&nbsp;DNS lookup utility</DIV
><DIV
CLASS="REFSYNOPSISDIV"
><A
NAME="AEN11"
></A
><H2
>Synopsis</H2
><P
><B
CLASS="COMMAND"
>host</B
>  [<VAR
CLASS="OPTION"
>-aCdlnrTwv</VAR
>] [<VAR
CLASS="OPTION"
>-c <VAR
CLASS="REPLACEABLE"
>class</VAR
></VAR
>] [<VAR
CLASS="OPTION"
>-N <VAR
CLASS="REPLACEABLE"
>ndots</VAR
></VAR
>] [<VAR
CLASS="OPTION"
>-R <VAR
CLASS="REPLACEABLE"
>number</VAR
></VAR
>] [<VAR
CLASS="OPTION"
>-t <VAR
CLASS="REPLACEABLE"
>type</VAR
></VAR
>] [<VAR
CLASS="OPTION"
>-W <VAR
CLASS="REPLACEABLE"
>wait</VAR
></VAR
>] [<VAR
CLASS="OPTION"
>-4</VAR
>] [<VAR
CLASS="OPTION"
>-6</VAR
>] {name} [server]</P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN37"
></A
><H2
>DESCRIPTION</H2
><P
><B
CLASS="COMMAND"
>host</B
>
d41 5
a45 10
<B
CLASS="COMMAND"
>host</B
>
prints a short summary of its command line arguments and options.</P
><P
><VAR
CLASS="PARAMETER"
>name</VAR
> is the domain name that is to be looked
d47 1
a47 4
IPv6 address, in which case <B
CLASS="COMMAND"
>host</B
> will by default
d49 2
a50 8
<VAR
CLASS="PARAMETER"
>server</VAR
> is an optional argument which is either
the name or IP address of the name server that <B
CLASS="COMMAND"
>host</B
>
d52 9
a60 25
<TT
CLASS="FILENAME"
>/etc/resolv.conf</TT
>.</P
><P
>The <VAR
CLASS="OPTION"
>-a</VAR
> (all) option is equivalent to setting the
<VAR
CLASS="OPTION"
>-v</VAR
> option and asking <B
CLASS="COMMAND"
>host</B
> to make
a query of type ANY.</P
><P
>When the <VAR
CLASS="OPTION"
>-C</VAR
> option is used, <B
CLASS="COMMAND"
>host</B
>
d62 1
a62 4
<VAR
CLASS="PARAMETER"
>name</VAR
> from all the listed authoritative name
d64 10
a73 23
records that are found for the zone.</P
><P
>The <VAR
CLASS="OPTION"
>-c</VAR
> option instructs to make a DNS query of class
<VAR
CLASS="PARAMETER"
>class</VAR
>.  This can be used to lookup Hesiod or
Chaosnet class resource records.  The default class is IN (Internet).</P
><P
>Verbose output is generated by <B
CLASS="COMMAND"
>host</B
> when the
<VAR
CLASS="OPTION"
>-d</VAR
> or <VAR
CLASS="OPTION"
>-v</VAR
> option is used.  The two
d75 13
a87 32
compatibility.  In previous versions, the <VAR
CLASS="OPTION"
>-d</VAR
> option
switched on debugging traces and <VAR
CLASS="OPTION"
>-v</VAR
> enabled verbose
output.</P
><P
>List mode is selected by the <VAR
CLASS="OPTION"
>-l</VAR
> option.  This makes
<B
CLASS="COMMAND"
>host</B
> perform a zone transfer for zone
<VAR
CLASS="PARAMETER"
>name</VAR
>.  Transfer the zone printing out the NS, PTR
and address records (A/AAAA).  If combined with <VAR
CLASS="OPTION"
>-a</VAR
>
all records will be printed.  </P
><P
>The <VAR
CLASS="OPTION"
>-i</VAR
>
d90 5
a94 10
The default is to use IP6.ARPA.</P
><P
>The <VAR
CLASS="OPTION"
>-N</VAR
> option sets the number of dots that have to be
in <VAR
CLASS="PARAMETER"
>name</VAR
> for it to be considered absolute.  The
d96 1
a96 4
<TT
CLASS="FILENAME"
>/etc/resolv.conf</TT
>, or 1 if no ndots statement is
d98 8
a105 25
will be searched for in the domains listed in the <SPAN
CLASS="TYPE"
>search</SPAN
>
or <SPAN
CLASS="TYPE"
>domain</SPAN
> directive in
<TT
CLASS="FILENAME"
>/etc/resolv.conf</TT
>.</P
><P
>The number of UDP retries for a lookup can be changed with the
<VAR
CLASS="OPTION"
>-R</VAR
> option.  <VAR
CLASS="PARAMETER"
>number</VAR
> indicates
how many times <B
CLASS="COMMAND"
>host</B
> will repeat a query that does
d107 7
a113 18
<VAR
CLASS="PARAMETER"
>number</VAR
> is negative or zero, the number of
retries will default to 1.</P
><P
>Non-recursive queries can be made via the <VAR
CLASS="OPTION"
>-r</VAR
> option.
Setting this option clears the <SPAN
CLASS="TYPE"
>RD</SPAN
> &mdash; recursion
desired &mdash; bit in the query which <B
CLASS="COMMAND"
>host</B
> makes.
d115 2
a116 11
attempt to resolve <VAR
CLASS="PARAMETER"
>name</VAR
>.  The
<VAR
CLASS="OPTION"
>-r</VAR
> option enables <B
CLASS="COMMAND"
>host</B
> to mimic
d119 5
a123 10
referrals to other name servers.</P
><P
>By default <B
CLASS="COMMAND"
>host</B
> uses UDP when making queries.  The
<VAR
CLASS="OPTION"
>-T</VAR
> option makes it use a TCP connection when querying
d125 10
a134 26
require it, such as zone transfer (AXFR) requests.</P
><P
>The <VAR
CLASS="OPTION"
>-4</VAR
> option forces <B
CLASS="COMMAND"
>host</B
> to only
use IPv4 query transport.  The <VAR
CLASS="OPTION"
>-6</VAR
> option forces
<B
CLASS="COMMAND"
>host</B
> to only use IPv6 query transport.</P
><P
>The <VAR
CLASS="OPTION"
>-t</VAR
> option is used to select the query type.
<VAR
CLASS="PARAMETER"
>type</VAR
> can be any recognised query type: CNAME,
d136 1
a136 4
<B
CLASS="COMMAND"
>host</B
> automatically selects an appropriate query
d138 3
a140 12
<VAR
CLASS="OPTION"
>-C</VAR
> option was given, queries will be made for SOA
records, and if <VAR
CLASS="PARAMETER"
>name</VAR
> is a dotted-decimal IPv4
address or colon-delimited IPv6 address, <B
CLASS="COMMAND"
>host</B
> will
d143 7
a149 24
starting serial number (e.g. -t IXFR=12345678).</P
><P
>The time to wait for a reply can be controlled through the
<VAR
CLASS="OPTION"
>-W</VAR
> and <VAR
CLASS="OPTION"
>-w</VAR
> options.  The
<VAR
CLASS="OPTION"
>-W</VAR
> option makes <B
CLASS="COMMAND"
>host</B
> wait for
<VAR
CLASS="PARAMETER"
>wait</VAR
> seconds.  If <VAR
CLASS="PARAMETER"
>wait</VAR
>
d151 1
a151 7
<VAR
CLASS="OPTION"
>-w</VAR
> option is used, <B
CLASS="COMMAND"
>host</B
> will
d154 18
a171 41
value for an integer quantity.</P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN115"
></A
><H2
>FILES</H2
><P
><TT
CLASS="FILENAME"
>/etc/resolv.conf</TT
></P
></DIV
><DIV
CLASS="REFSECT1"
><A
NAME="AEN119"
></A
><H2
>SEE ALSO</H2
><P
><SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>dig</SPAN
>(1)</SPAN
>,
<SPAN
CLASS="CITEREFENTRY"
><SPAN
CLASS="REFENTRYTITLE"
>named</SPAN
>(8)</SPAN
>.</P
></DIV
></BODY
></HTML
>
@


1.2
log
@update to BIND 9.2.2-release. ok millert@@
@
text
@d2 3
a4 2
 - Copyright (C) 2000, 2001  Internet Software Consortium.
 - 
d8 8
a15 9
 - 
 - THE SOFTWARE IS PROVIDED "AS IS" AND INTERNET SOFTWARE CONSORTIUM
 - DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE INCLUDING ALL
 - IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL
 - INTERNET SOFTWARE CONSORTIUM BE LIABLE FOR ANY SPECIAL, DIRECT,
 - INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING
 - FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT,
 - NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION
 - WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
d17 4
d27 1
a27 2
CONTENT="Modular DocBook HTML Stylesheet Version 1.73
"></HEAD
d38 2
a39 2
>host</A
></H1
d59 1
a59 1
>  [<TT
d61 2
a62 2
>-aCdlnrTwv</TT
>] [<TT
d64 1
a64 1
>-c <TT
d66 3
a68 5
><I
>class</I
></TT
></TT
>] [<TT
d70 1
a70 1
>-N <TT
d72 3
a74 5
><I
>ndots</I
></TT
></TT
>] [<TT
d76 1
a76 1
>-R <TT
d78 3
a80 5
><I
>number</I
></TT
></TT
>] [<TT
d82 1
a82 1
>-t <TT
d84 3
a86 5
><I
>type</I
></TT
></TT
>] [<TT
d88 1
a88 1
>-W <TT
d90 8
a97 4
><I
>wait</I
></TT
></TT
d103 1
a103 1
NAME="AEN33"
d121 1
a121 1
><TT
d123 1
a123 3
><I
>name</I
></TT
d131 1
a131 1
<TT
d133 1
a133 3
><I
>server</I
></TT
d145 1
a145 1
>The <TT
d147 1
a147 1
>-a</TT
d149 1
a149 1
<TT
d151 1
a151 1
>-v</TT
d158 1
a158 1
>When the <TT
d160 1
a160 1
>-C</TT
d166 1
a166 1
<TT
d168 1
a168 3
><I
>name</I
></TT
d173 1
a173 1
>The <TT
d175 1
a175 1
>-c</TT
d177 1
a177 1
<TT
d179 1
a179 3
><I
>class</I
></TT
d187 1
a187 1
<TT
d189 2
a190 2
>-d</TT
> or <TT
d192 1
a192 1
>-v</TT
d195 1
a195 1
compatibility.  In previous versions, the <TT
d197 1
a197 1
>-d</TT
d199 1
a199 1
switched on debugging traces and <TT
d201 1
a201 1
>-v</TT
d205 1
a205 1
>List mode is selected by the <TT
d207 1
a207 1
>-l</TT
d213 1
a213 1
<TT
d215 7
a221 6
><I
>name</I
></TT
>.  The argument is provided for
compatibility with older implementations.  This option is equivalent
to making a query of type AXFR.</P
d223 1
a223 1
>The <TT
d225 1
a225 1
>-n</TT
d228 2
a229 2
use the IP6.INT domain and "nibble" labels as defined in RFC1886.
The default is to use IP6.ARPA and binary labels as defined in RFC2874.</P
d231 1
a231 1
>The <TT
d233 1
a233 1
>-N</TT
d235 1
a235 1
in <TT
d237 1
a237 3
><I
>name</I
></TT
d259 1
a259 1
<TT
d261 2
a262 2
>-R</TT
> option.  <TT
d264 1
a264 3
><I
>number</I
></TT
d271 1
a271 1
<TT
d273 1
a273 3
><I
>number</I
></TT
d277 1
a277 1
>Non-recursive queries can be made via the <TT
d279 1
a279 1
>-r</TT
d290 1
a290 1
attempt to resolve <TT
d292 1
a292 3
><I
>name</I
></TT
d294 1
a294 1
<TT
d296 1
a296 1
>-r</TT
d309 1
a309 1
<TT
d311 1
a311 1
>-T</TT
d316 1
a316 1
>The <TT
d318 17
a334 1
>-t</TT
d336 1
a336 1
<TT
d338 1
a338 3
><I
>type</I
></TT
d346 1
a346 1
<TT
d348 1
a348 1
>-C</TT
d350 1
a350 1
records, and if <TT
d352 1
a352 3
><I
>name</I
></TT
d358 3
a360 1
query for PTR records.</P
d363 1
a363 1
<TT
d365 2
a366 2
>-W</TT
> and <TT
d368 1
a368 1
>-w</TT
d370 1
a370 1
<TT
d372 1
a372 1
>-W</TT
d377 4
a380 1
<TT
d382 1
a382 8
><I
>wait</I
></TT
> seconds.  If <TT
CLASS="PARAMETER"
><I
>wait</I
></TT
d385 1
a385 1
<TT
d387 1
a387 1
>-w</TT
d399 1
a399 1
NAME="AEN105"
d412 1
a412 1
NAME="AEN109"
@


1.1
log
@Initial revision
@
text
@d23 1
a23 1
CONTENT="Modular DocBook HTML Stylesheet Version 1.61
d228 1
a228 1
compatibility with older implemementations.  This option is equivalent
d440 1
a440 1
>@


1.1.1.1
log
@ISC BIND version 9.2.2rc1
@
text
@@


1.1.1.2
log
@ISC BIND version 9.3.0. ok deraadt@@
@
text
@d2 2
a3 3
 - Copyright (C) 2004  Internet Systems Consortium, Inc. ("ISC")
 - Copyright (C) 2000-2002  Internet Software Consortium.
 -
d7 9
a15 8
 -
 - THE SOFTWARE IS PROVIDED "AS IS" AND ISC DISCLAIMS ALL WARRANTIES WITH
 - REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY
 - AND FITNESS.  IN NO EVENT SHALL ISC BE LIABLE FOR ANY SPECIAL, DIRECT,
 - INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM
 - LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE
 - OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR
 - PERFORMANCE OF THIS SOFTWARE.
a16 4

<!-- $ISC: host.html,v 1.4.2.1.4.6 2004/08/22 23:38:58 marka Exp $ -->

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
d23 2
a24 1
CONTENT="Modular DocBook HTML Stylesheet Version 1.7"></HEAD
d35 2
a36 2
></A
>host</H1
d56 1
a56 1
>  [<VAR
d58 2
a59 2
>-aCdlnrTwv</VAR
>] [<VAR
d61 1
a61 1
>-c <VAR
d63 5
a67 3
>class</VAR
></VAR
>] [<VAR
d69 1
a69 1
>-N <VAR
d71 5
a75 3
>ndots</VAR
></VAR
>] [<VAR
d77 1
a77 1
>-R <VAR
d79 5
a83 3
>number</VAR
></VAR
>] [<VAR
d85 1
a85 1
>-t <VAR
d87 5
a91 3
>type</VAR
></VAR
>] [<VAR
d93 1
a93 1
>-W <VAR
d95 4
a98 8
>wait</VAR
></VAR
>] [<VAR
CLASS="OPTION"
>-4</VAR
>] [<VAR
CLASS="OPTION"
>-6</VAR
d104 1
a104 1
NAME="AEN37"
d122 1
a122 1
><VAR
d124 3
a126 1
>name</VAR
d134 1
a134 1
<VAR
d136 3
a138 1
>server</VAR
d150 1
a150 1
>The <VAR
d152 1
a152 1
>-a</VAR
d154 1
a154 1
<VAR
d156 1
a156 1
>-v</VAR
d163 1
a163 1
>When the <VAR
d165 1
a165 1
>-C</VAR
d171 1
a171 1
<VAR
d173 3
a175 1
>name</VAR
d180 1
a180 1
>The <VAR
d182 1
a182 1
>-c</VAR
d184 1
a184 1
<VAR
d186 3
a188 1
>class</VAR
d196 1
a196 1
<VAR
d198 2
a199 2
>-d</VAR
> or <VAR
d201 1
a201 1
>-v</VAR
d204 1
a204 1
compatibility.  In previous versions, the <VAR
d206 1
a206 1
>-d</VAR
d208 1
a208 1
switched on debugging traces and <VAR
d210 1
a210 1
>-v</VAR
d214 1
a214 1
>List mode is selected by the <VAR
d216 1
a216 1
>-l</VAR
d222 1
a222 1
<VAR
d224 6
a229 7
>name</VAR
>.  Transfer the zone printing out the NS, PTR
and address records (A/AAAA).  If combined with <VAR
CLASS="OPTION"
>-a</VAR
>
all records will be printed.  </P
d231 1
a231 1
>The <VAR
d233 1
a233 1
>-i</VAR
d236 2
a237 2
use the IP6.INT domain as defined in RFC1886.
The default is to use IP6.ARPA.</P
d239 1
a239 1
>The <VAR
d241 1
a241 1
>-N</VAR
d243 1
a243 1
in <VAR
d245 3
a247 1
>name</VAR
d269 1
a269 1
<VAR
d271 2
a272 2
>-R</VAR
> option.  <VAR
d274 3
a276 1
>number</VAR
d283 1
a283 1
<VAR
d285 3
a287 1
>number</VAR
d291 1
a291 1
>Non-recursive queries can be made via the <VAR
d293 1
a293 1
>-r</VAR
d304 1
a304 1
attempt to resolve <VAR
d306 3
a308 1
>name</VAR
d310 1
a310 1
<VAR
d312 1
a312 1
>-r</VAR
d325 1
a325 1
<VAR
d327 1
a327 1
>-T</VAR
d332 1
a332 1
>The <VAR
d334 1
a334 17
>-4</VAR
> option forces <B
CLASS="COMMAND"
>host</B
> to only
use IPv4 query transport.  The <VAR
CLASS="OPTION"
>-6</VAR
> option forces
<B
CLASS="COMMAND"
>host</B
> to only use IPv6 query transport.</P
><P
>The <VAR
CLASS="OPTION"
>-t</VAR
d336 1
a336 1
<VAR
d338 3
a340 1
>type</VAR
d348 1
a348 1
<VAR
d350 1
a350 1
>-C</VAR
d352 1
a352 1
records, and if <VAR
d354 3
a356 1
>name</VAR
d362 1
a362 3
query for PTR records.  If a query type of IXFR is chosen the starting
serial number can be specified by appending an equal followed by the
starting serial number (e.g. -t IXFR=12345678).</P
d365 1
a365 1
<VAR
d367 2
a368 2
>-W</VAR
> and <VAR
d370 1
a370 1
>-w</VAR
d372 1
a372 1
<VAR
d374 1
a374 1
>-W</VAR
d379 1
a379 4
<VAR
CLASS="PARAMETER"
>wait</VAR
> seconds.  If <VAR
d381 8
a388 1
>wait</VAR
d391 1
a391 1
<VAR
d393 1
a393 1
>-w</VAR
d405 1
a405 1
NAME="AEN115"
d418 1
a418 1
NAME="AEN119"
d440 1
a440 1
>
@


1.1.1.3
log
@ISC BIND release 9.3.2
@
text
@d2 3
a4 3
 - Copyright (C) 2004, 2005 Internet Systems Consortium, Inc. ("ISC")
 - Copyright (C) 2000-2002 Internet Software Consortium.
 - 
d8 1
a8 1
 - 
d11 1
a11 1
 - AND FITNESS. IN NO EVENT SHALL ISC BE LIABLE FOR ANY SPECIAL, DIRECT,
d17 95
a111 21
<!-- $ISC: host.html,v 1.4.2.1.4.12 2005/10/13 02:33:44 marka Exp $ -->
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<title>host</title>
<meta name="generator" content="DocBook XSL Stylesheets V1.69.1">
</head>
<body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="refentry" lang="en">
<a name="id2463721"></a><div class="titlepage"></div>
<div class="refnamediv">
<h2>Name</h2>
<p>host &#8212; DNS lookup utility</p>
</div>
<div class="refsynopsisdiv">
<h2>Synopsis</h2>
<div class="cmdsynopsis"><p><code class="command">host</code>  [<code class="option">-aCdlnrTwv</code>] [<code class="option">-c <em class="replaceable"><code>class</code></em></code>] [<code class="option">-N <em class="replaceable"><code>ndots</code></em></code>] [<code class="option">-R <em class="replaceable"><code>number</code></em></code>] [<code class="option">-t <em class="replaceable"><code>type</code></em></code>] [<code class="option">-W <em class="replaceable"><code>wait</code></em></code>] [<code class="option">-4</code>] [<code class="option">-6</code>] {name} [server]</p></div>
</div>
<div class="refsect1" lang="en">
<a name="id2525901"></a><h2>DESCRIPTION</h2>
<p>
<span><strong class="command">host</strong></span>
d115 10
a124 5
<span><strong class="command">host</strong></span>
prints a short summary of its command line arguments and options.
</p>
<p>
<em class="parameter"><code>name</code></em> is the domain name that is to be looked
d126 4
a129 1
IPv6 address, in which case <span><strong class="command">host</strong></span> will by default
d131 8
a138 2
<em class="parameter"><code>server</code></em> is an optional argument which is either
the name or IP address of the name server that <span><strong class="command">host</strong></span>
d140 25
a164 9
<code class="filename">/etc/resolv.conf</code>.
</p>
<p>
The <code class="option">-a</code> (all) option is equivalent to setting the
<code class="option">-v</code> option and asking <span><strong class="command">host</strong></span> to make
a query of type ANY.
</p>
<p>
When the <code class="option">-C</code> option is used, <span><strong class="command">host</strong></span>
d166 4
a169 1
<em class="parameter"><code>name</code></em> from all the listed authoritative name
d171 23
a193 10
records that are found for the zone.
</p>
<p>
The <code class="option">-c</code> option instructs to make a DNS query of class
<em class="parameter"><code>class</code></em>.  This can be used to lookup Hesiod or
Chaosnet class resource records.  The default class is IN (Internet).
</p>
<p>
Verbose output is generated by <span><strong class="command">host</strong></span> when the
<code class="option">-d</code> or <code class="option">-v</code> option is used.  The two
d195 32
a226 13
compatibility.  In previous versions, the <code class="option">-d</code> option
switched on debugging traces and <code class="option">-v</code> enabled verbose
output.
</p>
<p>
List mode is selected by the <code class="option">-l</code> option.  This makes
<span><strong class="command">host</strong></span> perform a zone transfer for zone
<em class="parameter"><code>name</code></em>.  Transfer the zone printing out the NS, PTR
and address records (A/AAAA).  If combined with <code class="option">-a</code>
all records will be printed.  
</p>
<p>
The <code class="option">-i</code>
d229 10
a238 5
The default is to use IP6.ARPA.
</p>
<p>
The <code class="option">-N</code> option sets the number of dots that have to be
in <em class="parameter"><code>name</code></em> for it to be considered absolute.  The
d240 4
a243 1
<code class="filename">/etc/resolv.conf</code>, or 1 if no ndots statement is
d245 25
a269 8
will be searched for in the domains listed in the <span class="type">search</span>
or <span class="type">domain</span> directive in
<code class="filename">/etc/resolv.conf</code>.
</p>
<p>
The number of UDP retries for a lookup can be changed with the
<code class="option">-R</code> option.  <em class="parameter"><code>number</code></em> indicates
how many times <span><strong class="command">host</strong></span> will repeat a query that does
d271 18
a288 7
<em class="parameter"><code>number</code></em> is negative or zero, the number of
retries will default to 1.
</p>
<p>
Non-recursive queries can be made via the <code class="option">-r</code> option.
Setting this option clears the <span class="type">RD</span> &#8212; recursion
desired &#8212; bit in the query which <span><strong class="command">host</strong></span> makes.
d290 11
a300 2
attempt to resolve <em class="parameter"><code>name</code></em>.  The
<code class="option">-r</code> option enables <span><strong class="command">host</strong></span> to mimic
d303 10
a312 5
referrals to other name servers.
</p>
<p>
By default <span><strong class="command">host</strong></span> uses UDP when making queries.  The
<code class="option">-T</code> option makes it use a TCP connection when querying
d314 26
a339 10
require it, such as zone transfer (AXFR) requests.
</p>
<p>
The <code class="option">-4</code> option forces <span><strong class="command">host</strong></span> to only
use IPv4 query transport.  The <code class="option">-6</code> option forces
<span><strong class="command">host</strong></span> to only use IPv6 query transport.
</p>
<p>
The <code class="option">-t</code> option is used to select the query type.
<em class="parameter"><code>type</code></em> can be any recognised query type: CNAME,
d341 4
a344 1
<span><strong class="command">host</strong></span> automatically selects an appropriate query
d346 12
a357 3
<code class="option">-C</code> option was given, queries will be made for SOA
records, and if <em class="parameter"><code>name</code></em> is a dotted-decimal IPv4
address or colon-delimited IPv6 address, <span><strong class="command">host</strong></span> will
d360 24
a383 7
starting serial number (e.g. -t IXFR=12345678).
</p>
<p>
The time to wait for a reply can be controlled through the
<code class="option">-W</code> and <code class="option">-w</code> options.  The
<code class="option">-W</code> option makes <span><strong class="command">host</strong></span> wait for
<em class="parameter"><code>wait</code></em> seconds.  If <em class="parameter"><code>wait</code></em>
d385 7
a391 1
<code class="option">-w</code> option is used, <span><strong class="command">host</strong></span> will
d394 41
a434 18
value for an integer quantity.
</p>
</div>
<div class="refsect1" lang="en">
<a name="id2526241"></a><h2>FILES</h2>
<p>
<code class="filename">/etc/resolv.conf</code>
</p>
</div>
<div class="refsect1" lang="en">
<a name="id2526253"></a><h2>SEE ALSO</h2>
<p>
<span class="citerefentry"><span class="refentrytitle">dig</span>(1)</span>,
<span class="citerefentry"><span class="refentrytitle">named</span>(8)</span>.
</p>
</div>
</div></body>
</html>
@


1.1.1.4
log
@ISC BIND release 9.3.3
@
text
@d17 1
a17 1
<!-- $ISC: host.html,v 1.4.2.1.4.14 2006/06/29 13:02:30 marka Exp $ -->
d22 1
a22 1
<meta name="generator" content="DocBook XSL Stylesheets V1.70.1">
d25 1
a25 1
<a name="id2482688"></a><div class="titlepage"></div>
d35 1
a35 1
<a name="id2549466"></a><h2>DESCRIPTION</h2>
d158 1
a158 1
<a name="id2549874"></a><h2>FILES</h2>
d164 1
a164 1
<a name="id2549886"></a><h2>SEE ALSO</h2>
@


1.1.1.5
log
@ISC BIND release 9.4.2
@
text
@d2 1
a2 1
 - Copyright (C) 2004, 2005, 2007 Internet Systems Consortium, Inc. ("ISC")
d17 1
a17 1
<!-- $ISC: host.html,v 1.7.18.20 2007/05/09 03:33:12 marka Exp $ -->
d22 1
a22 1
<meta name="generator" content="DocBook XSL Stylesheets V1.71.1">
d25 1
a25 1
<a name="man.host"></a><div class="titlepage"></div>
d32 1
a32 1
<div class="cmdsynopsis"><p><code class="command">host</code>  [<code class="option">-aCdlnrsTwv</code>] [<code class="option">-c <em class="replaceable"><code>class</code></em></code>] [<code class="option">-N <em class="replaceable"><code>ndots</code></em></code>] [<code class="option">-R <em class="replaceable"><code>number</code></em></code>] [<code class="option">-t <em class="replaceable"><code>type</code></em></code>] [<code class="option">-W <em class="replaceable"><code>wait</code></em></code>] [<code class="option">-m <em class="replaceable"><code>flag</code></em></code>] [<code class="option">-4</code>] [<code class="option">-6</code>] {name} [server]</p></div>
d35 121
a155 150
<a name="id2543428"></a><h2>DESCRIPTION</h2>
<p><span><strong class="command">host</strong></span>
      is a simple utility for performing DNS lookups.
      It is normally used to convert names to IP addresses and vice versa.
      When no arguments or options are given,
      <span><strong class="command">host</strong></span>
      prints a short summary of its command line arguments and options.
    </p>
<p><em class="parameter"><code>name</code></em> is the domain name that is to be
      looked
      up.  It can also be a dotted-decimal IPv4 address or a colon-delimited
      IPv6 address, in which case <span><strong class="command">host</strong></span> will by
      default
      perform a reverse lookup for that address.
      <em class="parameter"><code>server</code></em> is an optional argument which
      is either
      the name or IP address of the name server that <span><strong class="command">host</strong></span>
      should query instead of the server or servers listed in
      <code class="filename">/etc/resolv.conf</code>.
    </p>
<p>
      The <code class="option">-a</code> (all) option is equivalent to setting the
      <code class="option">-v</code> option and asking <span><strong class="command">host</strong></span> to make
      a query of type ANY.
    </p>
<p>
      When the <code class="option">-C</code> option is used, <span><strong class="command">host</strong></span>
      will attempt to display the SOA records for zone
      <em class="parameter"><code>name</code></em> from all the listed
      authoritative name
      servers for that zone.  The list of name servers is defined by the NS
      records that are found for the zone.
    </p>
<p>
      The <code class="option">-c</code> option instructs to make a DNS query of class
      <em class="parameter"><code>class</code></em>.  This can be used to lookup
      Hesiod or
      Chaosnet class resource records.  The default class is IN (Internet).
    </p>
<p>
      Verbose output is generated by <span><strong class="command">host</strong></span> when
      the
      <code class="option">-d</code> or <code class="option">-v</code> option is used.  The two
      options are equivalent.  They have been provided for backwards
      compatibility.  In previous versions, the <code class="option">-d</code> option
      switched on debugging traces and <code class="option">-v</code> enabled verbose
      output.
    </p>
<p>
      List mode is selected by the <code class="option">-l</code> option.  This makes
      <span><strong class="command">host</strong></span> perform a zone transfer for zone
      <em class="parameter"><code>name</code></em>.  Transfer the zone printing out
      the NS, PTR
      and address records (A/AAAA).  If combined with <code class="option">-a</code>
      all records will be printed.
    </p>
<p>
      The <code class="option">-i</code>
      option specifies that reverse lookups of IPv6 addresses should
      use the IP6.INT domain as defined in RFC1886.
      The default is to use IP6.ARPA.
    </p>
<p>
      The <code class="option">-N</code> option sets the number of dots that have to be
      in <em class="parameter"><code>name</code></em> for it to be considered
      absolute.  The
      default value is that defined using the ndots statement in
      <code class="filename">/etc/resolv.conf</code>, or 1 if no ndots
      statement is
      present.  Names with fewer dots are interpreted as relative names and
      will be searched for in the domains listed in the <span class="type">search</span>
      or <span class="type">domain</span> directive in
      <code class="filename">/etc/resolv.conf</code>.
    </p>
<p>
      The number of UDP retries for a lookup can be changed with the
      <code class="option">-R</code> option.  <em class="parameter"><code>number</code></em>
      indicates
      how many times <span><strong class="command">host</strong></span> will repeat a query
      that does
      not get answered.  The default number of retries is 1.  If
      <em class="parameter"><code>number</code></em> is negative or zero, the
      number of
      retries will default to 1.
    </p>
<p>
      Non-recursive queries can be made via the <code class="option">-r</code> option.
      Setting this option clears the <span class="type">RD</span> &#8212; recursion
      desired &#8212; bit in the query which <span><strong class="command">host</strong></span> makes.
      This should mean that the name server receiving the query will not
      attempt to resolve <em class="parameter"><code>name</code></em>.  The
      <code class="option">-r</code> option enables <span><strong class="command">host</strong></span>
      to mimic
      the behavior of a name server by making non-recursive queries and
      expecting to receive answers to those queries that are usually
      referrals to other name servers.
    </p>
<p>
      By default <span><strong class="command">host</strong></span> uses UDP when making
      queries.  The
      <code class="option">-T</code> option makes it use a TCP connection when querying
      the name server.  TCP will be automatically selected for queries that
      require it, such as zone transfer (AXFR) requests.
    </p>
<p>
      The <code class="option">-4</code> option forces <span><strong class="command">host</strong></span> to only
      use IPv4 query transport.  The <code class="option">-6</code> option forces
      <span><strong class="command">host</strong></span> to only use IPv6 query transport.
    </p>
<p>
      The <code class="option">-t</code> option is used to select the query type.
      <em class="parameter"><code>type</code></em> can be any recognized query
      type: CNAME,
      NS, SOA, SIG, KEY, AXFR, etc.  When no query type is specified,
      <span><strong class="command">host</strong></span> automatically selects an appropriate
      query
      type.  By default it looks for A records, but if the
      <code class="option">-C</code> option was given, queries will be made for SOA
      records, and if <em class="parameter"><code>name</code></em> is a
      dotted-decimal IPv4
      address or colon-delimited IPv6 address, <span><strong class="command">host</strong></span> will
      query for PTR records.  If a query type of IXFR is chosen the starting
      serial number can be specified by appending an equal followed by the
      starting serial number (e.g. -t IXFR=12345678).
    </p>
<p>
      The time to wait for a reply can be controlled through the
      <code class="option">-W</code> and <code class="option">-w</code> options.  The
      <code class="option">-W</code> option makes <span><strong class="command">host</strong></span>
      wait for
      <em class="parameter"><code>wait</code></em> seconds.  If <em class="parameter"><code>wait</code></em>
      is less than one, the wait interval is set to one second.  When the
      <code class="option">-w</code> option is used, <span><strong class="command">host</strong></span>
      will
      effectively wait forever for a reply.  The time to wait for a response
      will be set to the number of seconds given by the hardware's maximum
      value for an integer quantity.
    </p>
<p>
      The <code class="option">-s</code> option tells <span><strong class="command">host</strong></span> 
      <span class="emphasis"><em>not</em></span> to send the query to the next nameserver
      if any server responds with a SERVFAIL response, which is the
      reverse of normal stub resolver behavior.
    </p>
<p>
      The <code class="option">-m</code> can be used to set the memory usage debugging
      flags
      <em class="parameter"><code>record</code></em>, <em class="parameter"><code>usage</code></em> and
      <em class="parameter"><code>trace</code></em>.
    </p>
d158 1
a158 1
<a name="id2543725"></a><h2>IDN SUPPORT</h2>
d160 2
a161 10
      If <span><strong class="command">host</strong></span> has been built with IDN (internationalized
      domain name) support, it can accept and display non-ASCII domain names. 
      <span><strong class="command">host</strong></span> appropriately converts character encoding of
      domain name before sending a request to DNS server or displaying a
      reply from the server.
      If you'd like to turn off the IDN support for some reason, defines
      the <code class="envar">IDN_DISABLE</code> environment variable.
      The IDN support is disabled if the variable is set when
      <span><strong class="command">host</strong></span> runs.
    </p>
d164 5
a168 9
<a name="id2543748"></a><h2>FILES</h2>
<p><code class="filename">/etc/resolv.conf</code>
    </p>
</div>
<div class="refsect1" lang="en">
<a name="id2543828"></a><h2>SEE ALSO</h2>
<p><span class="citerefentry"><span class="refentrytitle">dig</span>(1)</span>,
      <span class="citerefentry"><span class="refentrytitle">named</span>(8)</span>.
    </p>
@


